       IDENTIFICATION DIVISION.
           PROGRAM-ID. WELLOWORLD.
           AUTHOR. ROMULO CESAR
       ENVIRONMENT DIVISION.
      
       DATA DIVISION.

       PROCEDURE DIVISION.
       PRINCIPAL.
           DISPLAY "Hello World".

       STOP RUN.
       END PROGRAM WELLOWORLD.
       