       IDENTIFICATION DIVISION.
           PROGRAM-ID. GravarDados.
           AUTHOR. ROMULO CESAR.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL 
           SELECT NOTAS-PRIMEIRO-B ASSIGN TO  "NotasBimestre1"
               ORGANIZATION IS LINE SEQUENTIAL.
           
           SELECT NOTAS-SEGUNDO-B ASSIGN TO "NotasBimestre2"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT NOTAS-TERCEIRO-B ASSIGN TO "NotasBimentre3"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT NOTAS-QUANTO-B ASSIGN TO "NotasBimentre4"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT NOTA-QUINTO-B ASSIGN TO "NotasBimentre5"
               ORGANIZATION IS LINE SEQUENTIAL.
