        IDENTIFICATION DIVISION
        PROGRAM-ID. PROG-GRAV-ARG
        AUTHOR. ROMULO CESAR.
        
        ENVIRONMENT DIVISION.
        
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
        
        DATA DIVISION.
        
        FILE SECTION